---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZonesOverlapWarning
source: html/9005aeae-ddc5-e889-25b5-c659a8797c2a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ZoneFailures.ZonesOverlapWarning Property

Zone overlap to another zone or another room.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZonesOverlapWarning { get; }
```